Repository: mishin/perldoc-ru
Catalog: pod2-ru/tm/The Grails Framework 2.0.0 - Reference Documentation-level2.tmx
Source language: en_us
Languages: ru_ru

source: If you don't want this to happen use Groovy's ability to define multiple classes per file and include the Address class below the Person class in the grails-app/domain/Person.groovy file
ru_ru: Если вы не хотите, чтобы это произошло, используйте возможность Groovy определять различные классы в одном и том же файле, и включите класс Address после класса Person в файле grails-app/domain/Person.groovy.

source: If you have a large numbers of entries in the association this can be costly in terms of performance.
ru_ru: Если у вас есть большое количество записей в ассоциации, это может быть дорогостоящим с точки зрения производительности.

source: If you have the dbCreate property set to "update", "create" or "create-drop" on your DataSource, Grails will automatically generate/modify the database tables for you.
ru_ru: Если вы установили свойство dbCreate в "update", "create" или "create-drop" в файле DataSource, Grails будет автоматически генерировать/модифицировать для вас таблицы базы данных.

source: If you have two properties of the same type on the many side of a one-to-many you have to use mappedBy to specify which the collection is mapped:
ru_ru: Если у вас на стороне "многим" отношения "один-ко-многим" есть два свойства одного типа, вы должны использовать mappedBy чтобы определить, которое свойство относится к коллекции:

source: If you need "eager" fetching you can use the ORM DSL or specify eager fetching as part of a query
ru_ru: Если вам нужна "энергичная" выборка, вы должны использовать ORM DSL или определить энергичную выборку как часть запроса

source: If you need to open a file whilst within interactive mode you can use the open command which will TAB complete file paths:
ru_ru: Если во время интерактивного режима вам надо открыть файл, вы можете использовать команду open которая будет комплектовать путь к файлу по клавише TAB:

source: If you need to run an external process whilst interactive mode is running you can do so by starting the command with a !:
ru_ru: Если во время интерактивного режима вам надо запустить внешний процесс, вы можете сделать это, начав команду со знака !:

source: If you use the dynamic log property, then the name of the logger is 'grails.app.<type>.<className>', where type is the type of the artifact, for example 'controller' or 'service, and className is the fully qualified name of the artifact.
ru_ru: Если вы используете динамическое свойство log, то имя регистратора - 'grails.app.<type>.<className>', где type это тип артефакта, например 'controller' или 'service, а className это полностью определенное имя артефакта.

source: If you want a Map of objects then you can do this:
ru_ru: Если вам нужна карта объектов, то вы должны сделать так:

source: If you want a simple map of string/value pairs GORM can map this with the following:
ru_ru: Если вам нужна просто карта пар строка/значение, GORM может отобразить это следующим образом:

source: If you wish to use newer features of the Servlet API (such as 3.0) you should configure the grails.servlet.version in BuildConfig.groovy appropriately:
ru_ru: Если вы хотите использовать новые возможности Servlet API (таких как 3.0) вы должны соответствующим образом настроить grails.servlet.version в файле BuildConfig.groovy:

source: If you're interested, look into the Gant documentation.
ru_ru: Если Вам интересно, посмотрите в документации Gant.

source: If your actions are performed in the context of a transaction, flushing will execute SQL updates but the database will save the changes in its transaction queue and only finalize the updates when the transaction commits.
ru_ru: Если ваши действия выполняются в контексте транзакции, flushing будет выполнять SQL обновления, но база данных будет сохранять изменения в порядке очереди транзакций, и финализирует обновления только при финализации транзакции.

source: In addition simply typing 'grails' at the command line activates the new interactive mode which features TAB completion, command history and keeps the JVM running to ensure commands execute much quicker than otherwise
ru_ru: Кроме того, просто набрав "Grails" в командной строке, активизируется новый интерактивный режим, который имеет автодополнение, историю команд и поддерживает работу JVM для обеспечения более быстрого выполнения команд.

source: In addition stack trace filtering has been further enhanced to display only relevant trace information:
ru_ru: Кроме того, фильтрация трассировки стека была значительно улучшена, чтобы выводить на экран только соответствующую трассировочную информацию:

source: In addition, Grails supports Servlet versions 2.5 and above.
ru_ru: В добавок, Grails поддерживает Servlet версии 2.5 и выше.

source: In addition, any such restructuring or renaming of section titles resulted in breaking changes to the URLs.
ru_ru: Кроме того, любое такое реструктурирование или переименование заголовков разделов приводило к критическим повреждениям в URL-адресах.

source: In addition, the Grails documentation engine has received a facelift with a new template for presenting Grails application and plugin documentation:
ru_ru: Кроме того, движок документации Grails получил новые шаблоны для представления документации приложений и плагинов Grails:

source: In addition, you can also load a proxy for an instance by using the load method:
ru_ru: В добавок, используя метод load, вы можете загрузить прокси для экземпляра:

source: In fact this is now the preferred way of expressing an action.
ru_ru: Фактически - теперь это предпочтительный способ определения акции.

source: In general Grails makes its best effort to display update information on a single line and only present the information that is crucial.
ru_ru: В общем Grails делает все возможное, чтобы отобразить обновленную информацию в одной строчке и представить только ту информацию, которая имеет решающее значение.

source: In general our advice is if you're going to use inheritance, don't abuse it and don't make your inheritance hierarchy too deep.
ru_ru: В целом наш совет: если вы собираетесь использовать наследование, не злоупотребляйте и не делайте иерархию наследования слишком глубоко.

source: In other words when you have:
ru_ru: Другими словами. когда у вас есть:

source: In other words, saves and deletes will cascade from Face to the associated Nose:
ru_ru: Другими словами, сохранение и удаление будет каскадным от Face к ассоциированному с ним Nose:

source: In other words, to open the test report in a browser simply execute open test-report.
ru_ru: Другими словами, чтобы открыть в браузере отчет о тестировании, просто выполните open test-report.

source: In previous versions of Grails (1.0.3 and below), the variable was Ant, i.e. with a capital first letter.
ru_ru: В предыдущих версиях Grails (1.0.3 и ниже), была переменная Ant, т.е. с заглавной первой буквы.

source: In the above example we have a parent Content class and then various child classes with more specific behaviour.
ru_ru: В примере выше у нас есть родительский класс Content и различные дочерние классы с более специфическим поведением.

source: In the case of findOrSaveWhere and findOrSaveBy, the instance is saved before being returned.
ru_ru: В случае findOrSaveWhere и findOrSaveBy, перед возвращением экземпляр сохраняется.

source: In the example above, we specified a target with the explicit name "default".
ru_ru: В примере выше, мы определили цель с явным именем "default".

source: In this case a java.util.SortedSet implementation is used which means you must implement java.lang.Comparable in your Book class:
ru_ru: В этом случае используется реализация java.util.SortedSet, что означает, что вы должны реализовать java.lang.Comparable в классе "Book":

source: In this case instead of mapping classes onto separate tables a class can be "embedded" within the current table.
ru_ru: В этом случае, вместо отображения классов в различных таблицах, классы могут быть "встроены" в существующую таблицу.

source: In this case the key and value of the map MUST be strings.
ru_ru: В этом случае ключ и значение карты должно быть строкой.

source: In this case the underlying Hibernate engine will not do any dirty checking and the object will not be persisted.
ru_ru: В этом случае движок Hibernate не будет совершать никаких проверок, и объект не будет сохранен.

source: In this case we have a unidirectional many-to-one relationship from Face to Nose.
ru_ru: В этом случае у нас есть отношения многие-к-одному от Face к Nose.

source: In this case we have a unidirectional one-to-many.
ru_ru: В этом случае у нас есть однонаправленное отношение один-ко-многим.

source: In this case we use the belongsTo setting to say that Nose "belongs to" Face.
ru_ru: В этом случае мы используем свойство belongsTo чтобы сказать, что Nose "принадлежит (belongs to)" Face.

source: In this case when you add new elements to the books collection the order is retained in a sequential list indexed from 0 so you can do:
ru_ru: В этом случае, когда вы добавляете новый элемент в коллекцию books, порядок сохраняется и в последовательном списке индексируется от 0, так что вы можете делать так:

source: In this example the association link is being created by the child (Book) and hence it is not necessary to manipulate the collection directly resulting in fewer queries and more efficient code.
ru_ru: В этом примере все ассоциативные ссылки были созданы дочерним классом (Book) и следовательно, нет необходимости непосредственно манипулировать коллекцией, что приводит к меньшему количеству запросов и более эффективному коду.

source: Included out the box are things like:
ru_ru: Из коробки включает в себя такие вещи, как:

source: Inheritance in GORM
ru_ru: Наследование в GORM

source: Installation Requirements
ru_ru: Требования по установке

source: Interactive Mode
ru_ru: Интерактивный режим

source: Interactive Mode and Console Enhancements
ru_ru: Интерактивный режим и улучшения консоли

source: Interactive mode is the a feature of the Grails command line which keeps the JVM running and allows for quicker execution of commands.
ru_ru: Интерактивный режим - это функция командной строки Grails, которая выполняется на запущеной JVM и позволяет быстро выполнять команды.

source: It is now possible to bind form parameters to action arguments where the name of the form element matches the argument name.
ru_ru: Теперь можно связать параметры формы с аргументами акции, где имя элемента формы соответствует имени параметра.

source: It is now possible to completely disable resolution from inherited repositories (repositories defined by other plugins):
ru_ru: Теперь возможно полностью отключить решение из наследованных репозитариев (репозитарии, определенные другими плагинами):

source: It is now possible to customize the ivy cache directory via BuildConfig.groovy
ru_ru: Теперь возможно настроить каталог кэша ivy через BuildConfig.groovy

source: It is now possible to define controller actions as methods instead of using closures as in previous versions of Grails.
ru_ru: Теепрь можно определять акции контроллера как методы, вместо использования замыкания как в предыдущих версиях Grails.

source: It is now possible to define multiple datasources in DataSource.groovy and declare one or more datasources a particular domain uses by default:
ru_ru: Теперь в DataSource.groovy возможно определять множественные источники данных и обьявлять один или более источник данных определенного домена, используемого по умолчанию:

source: It is now possible to easily disable checksum validation errors:
ru_ru: Теперь возможно легко отключить ошибки проверки допустимости контрольной суммы:

source: It may seem odd that in a framework that embraces "convention-over-configuration" that we tackle this topic now, but since what configuration there is typically a one-off, it is best to get it out the way.
ru_ru: Может показаться странным, что мы подняли эту тему сейчас во фреймворке, который охвачен "соглашениями вместо конфигурации", но так как конфигурация там обычно one-off, лучше изучить это.

source: It's often useful to provide custom arguments to the JVM when running Grails commands, in particular with run-app where you may for example want to set a higher maximum heap size.
ru_ru: Часто бывает полезным обеспечить пользовательские аргументы JVM когда запускаешь команды Grails, особенно с run-app, где вы можете, например, захотеть установить более высокое максимальное значение выделяемой памяти.

source: Java web development as it stands today is dramatically more complicated than it needs to be.
ru_ru: Веб-разработка на Java в ее нынешнем виде является значительно более сложной, чем это необходимо.

source: Lets you control what gets included in the WAR file from the "web-app" directory.
ru_ru: Позволяет вам контролировать, что включает в себя директория "web-app" внутри файла WAR.

source: Lets you customise what libaries are included in the WAR file.
ru_ru: Позволяет вам настраивать, какие библиотеки будут включены в файл WAR

source: Like the LinkGenerator the new PageRenderer can be used to render GSP pages outside the scope of a web request, such as in a scheduled job or web service.
ru_ru: Так же как и LinkGenerator, новый PageRenderer может быть использован для рендеринга GSP страниц вне контекста веб запроса, таких как фоновый процесс или веб служба.

source: Likewise, log.debug(msg) will log it at 'debug'.
ru_ru: Также, log.debug(msg) будет регистрировать его на уровне 'debug'.

source: Link Generation API
ru_ru: API генерации ссылок

source: Lists of Objects
ru_ru: Списки объектов

source: Loggers
ru_ru: Регистраторы

source: Loggers are fundamental to the logging system, but they are a source of some confusion.
ru_ru: Регистраторы имеют основополагающее значение для системы протоколирования, но они являются источником некоторой путаницы.

source: Loggers with names starting with 'org.apache.catalina' logger only show messages at the 'warn' level and above.
ru_ru: Регистраторам, с именами начинающимися с 'org.apache.catalina' показываются сообщения только уровня 'warn' и выше.

source: Logging
ru_ru: Протоколирование

source: Logging levels
ru_ru: Уровни регистраторов

source: Many-to-many
ru_ru: Многие-ко-многим

source: Many-to-one and one-to-one
ru_ru: Многие-к-одному и один-к-одному

source: Map books // map of ISBN:book names }
ru_ru: Map books // отображение ISBN:имя книги }

source: Maps of Objects
ru_ru: Карты объектов

source: Messages at other levels will be ignored.
ru_ru: Сообщения других уровней будут проигнорированы.

source: Most modern web frameworks in the Java space are over complicated and don't embrace the Don't Repeat Yourself (DRY) principles.
ru_ru: Большинство современных веб-каркасов в пространстве Java очень сложные и не используют принцип Не Повторяйся (Don't Repeat Yourself - DRY).

source: Multiple Data Sources Support
ru_ru: Поддержка множественных источников данных

source: New Test Report and Documentation Templates
ru_ru: Новые отчеты тестов и шаблоны документации

source: New Unit Testing API
ru_ru: Новые API Unit тестирования

source: New Unit Testing Console Output
ru_ru: Новая консоль вывода Unit тестирования

source: New findOrCreate and findOrSave Methods
ru_ru: Новые методы findOrCreate и findOrSave

source: No.
ru_ru: Нет.

source: Note that although JDK 1.6 is required to use Grails at development time it is possible to deploy Grails to JDK 1.5 VMs by setting the grails.project.source.level and grails.project.target.level settings to "1.5" in grails-app/conf/BuildConfig.groovy:
ru_ru: Заметьте, что хотя JDK 1.6 необходима Grails в режиме разработки, есть возможность развернуть Grails на VM JDK 1.5 установив в файле grails-app/conf/BuildConfig.groovy значения grails.project.source.level и grails.project.target.level = "1.5":

source: Note that flushing is not the same as committing a transaction.
ru_ru: Заметьте, что сброс (flushing) это не то же самое что и фиксация транзакции (committing a transaction).

source: Note that if you explicitly call the save method then the object is placed back into a read-write state.
ru_ru: Заметьте, что если вы явно вызовите метод save, то объект вернется в состояние "чтение-запись".

source: Note that the inverse is not true and will result in an error due to a transient Face:
ru_ru: Заметьте, что обратное не верно, и приведет к ошибке из-за transient Face:

source: Note that using this property puts the foreign key on the inverse table to the previous example, so in this case the foreign key column is stored in the nose table inside a column called face_id.
ru_ru: Отметьте, что использование этого свойства вводит внешний ключ на обратной к предыдущему примеру таблице, так в нашем случае, внешний ключ сохранен в таблице nose в колонке face_id.

source: Note that with !
ru_ru: Обратите внимание, что с командой !

source: Note there are many more small enhancements and improvements, these sections just cover some of the highlights.
ru_ru: Обратите внимание, что есть много небольших улучшений и усовершенствований, а в этом разделе просто рассмотрим некоторые из основных моментов.

source: Now if we delete the Face instance, the Nose will go too:
ru_ru: Теперь, если мы удалим экземпляр Face, то Nose последует туда-же:

source: Now that you have a domain class you can define its properties as Java types.
ru_ru: Теперь, когда у вас есть доменный класс, вы можете определить его свойства как Java типы.

source: Of particular use are the compile, package and bootstrap scripts.
ru_ru: Скрипты compile, package and bootstrap используются особым образом.

source: On some platforms (for example OS X) the Java installation is automatically detected.
ru_ru: На некоторых платформах (напримерOS X), Java уже установлена.

source: Once you have a domain class try and manipulate it with the shell or console by typing:
ru_ru: Как только у вас будет доменный класс, поэксперементируйте с ним при помощи shell или console введя:

source: One common case where Hibernate will flush cached updates is when performing queries since the cached information might be included in the query results.
ru_ru: Один общий случай, когда Hibernate будет сбрасывать кэш обновлений, это при выполнении запроса, поскольку кэшированные данные могут быть включены в результаты запроса.

source: One thing we would say is that if you want to allow other scripts to call your "default" target, you should move it into a shared script that doesn't have a default target at all.
ru_ru: Мы должны сказать одну вещь - если вы хотите предоставить другим скриптам вызывать вашу цель "default", you should move it into a shared script that doesn't have a default target at all.

source: One-to-many
ru_ru: Один-ко-многим

source: Page Rendering API
ru_ru: API рендеринга страниц

source: Performance Improvements
ru_ru: Улучшения производительности

source: Performance of GSP page rendering has once again been improved by optimizing the GSP compiler to inline method calls where possible.
ru_ru: Производительность рендеринга страницы GSP была еще раз улучшена оптимизацией компилятора GSP, чтобы встроить вызовы методов, где только возможно.

source: Persistence Basics
ru_ru: Основы персистенции

source: Persistence Features
ru_ru: Особенности персистентности

source: Plug-ins
ru_ru: Плагины

source: Plugin Usage Tracking
ru_ru: Использование отслеживания плагинов

source: Plugins dependencies now appear in the dependency report generated by grails dependency-report
ru_ru: Зависимости плагинов теперь появляются в отчете о зависимостях, генерируемом по команде grails dependency-report

source: Plugins published with the release plugin now publish their transitive plugin dependencies in the generated POM which are later resolved.
ru_ru: Теперь плагины публикуются вместе со своими зависимостями в сгенерированном РОМ-файле, которые затем решаются.

source: Polymorphic Queries
ru_ru: Полиморфные запросы

source: Pulling in targets from other scripts
ru_ru: Вытягивание целей из других сценариев

source: Quick Reference
ru_ru: Справочник

source: Quick Start Guide
ru_ru: Краткое руководство

source: Re-using Grails scripts
ru_ru: Повторное использование Grails скриптов

source: Refer to the documentation on the Prototype plugin for installation instructions.
ru_ru: Инструкцию по установке плагина Prototype смотрите в документации.

source: Refer to the Command Line reference in the Quick Reference menu of the reference guide for more information about individual commands
ru_ru: Перейдите по ссылке Командная строка в меню Справочник для получения более подробной информации о командах.

source: Relationships define how domain classes interact with each other.
ru_ru: Отношения определяют, как доменные классы взаимодействуют друг с другом.

source: Reloading Agent
ru_ru: Агент загрузки

source: Results in a search for the following files:
ru_ru: Будут искаться следующие файлы:

source: Saving and Updating
ru_ru: Сохранение и обновление

source: See createLink.
ru_ru: Смотри createLink.

source: See the documentation on DetachedCriteria and Where Queries for more information.
ru_ru: Для получения дополнительной информации смотри разделы DetachedCriteria и Where Queries.

source: See the light - agile, industrial strength, rapid web application development made easy
ru_ru: Смотри - гибкая, мощная, быстрая разработка веб приложений стала проще

source: See the section on Binary plugins for more information.
ru_ru: Подробнее смотри раздел Бинарные плагины.

source: See the section on Hibernate Integration for how to write domain classes in Java but still use dynamic persistent methods.
ru_ru: Смотри раздел Hibernate Integration чтобы узнать, как написать доменные классы на Java, но все же используя динамические методы персистенции.

source: See the section on the documentation engine for more usage info.
ru_ru: Для получения дополнительной информации по использованию смотри раздел механизм документации.

source: Services
ru_ru: Службы

source: Servlet 3.0 Async Features
ru_ru: Особенности Асинхронных Servlet 3.0

source: Servlet API
ru_ru: API Сервлетов

source: Sets guarantee uniquenes but not order, which may not be what you want.
ru_ru: Наборы гарантируют уникальность, но не упорядочение, и это может бытьне тем, что вы хотите.

source: Sets of Objects
ru_ru: Наборы объектов

source: Sets, Lists and Maps
ru_ru: Наборы, списки и карты

source: Simple.
ru_ru: Просто.

source: Simply "append" a file or class to it using the left-shift operator:
ru_ru: Просто "добавте" файл или класс к нему используя оператор сдвига влево:

source: Since uniqueness and order aren't managed by Hibernate, adding to or removing from collections mapped as a Bag don't trigger a load of all existing instances from the database, so this approach will perform better and require less memory than using a Set or a List.
ru_ru: Поскольку упорядочивание и уникальность не управляются Hibernate, добавление в коллекцию, отображаемую как Bag, или удаление из нее не означает загрузку всех существующих экземпляров из базы данных, так что такой подход будет выполняться лучше и занимать меньше памяти чем Set или List.

source: So if you configure a logger with a level of 'off', then no messages will be written out.
ru_ru: Так, если вы настроете регистратор с уровнем 'off', то не будут выводиться никакие сообщения.

source: So typing
ru_ru: Таким образом, при вводе

source: So what does this log4j setting look like?
ru_ru: Итак, как же выглядят эти настройки log4j?

source: So why have a configuration for it?
ru_ru: Так почему же есть конфигурация для него?
